{
   "version":"10",
   "name": "Samuel J Cross",
   "position": "Full Stack Developer",
   "address": "Flat 18 Pear Tree Court, Holmer Green, High Wycombe, England HP15 6RL",
   "telephone": "07708220359",
   "website": "http://samcross.uk",
   "cv": "http:/samcross.uk/cv",
   "email": "sam@cross.contact",
   "github": "samdems",
   "linkedin":"sam-cross-67038693",
   "personalProfile": "I am an outgoing and confident individual with a broad range of academic and social interests. I can be self-sufficient but also enjoy working with others. I love learning and developing myself. I am happiest when developing new skills and capabilities. I have learned to overcome my dyslexia by using text to speech and speech recognition tools, and developed my own shortcuts and scripts, to help me read, write and spell with greater accuracy. It may take me longer but with the emergence of new AI tools this has become far less of an issue. I am able to produce degree level material when required.",
   "experience": [
      {
         "position": "Senior PHP Developer",
         "employer": "Onbuy",
         "startDate": "2023-05-01",
         "endDate": "2023-10-01",
         "description": "I joined the revenue team, which managed the financial processes for their retail platform. The system used microservices predominantly developed in Laravel for which I have significant development experience. My main contribution was the development and launch of the cashback feature. Latterly, I was required to integrate a third party advertising service with their legacy monolith which was based on a custom PHP framework."
      },
      {
         "position": "Full Stack Developer",
         "employer": "Narrative Industries",
         "startDate": "2022-12-01",
         "endDate": "2023-05-01",
         "description": "For this remote role I worked on a rewrite of an existing retail website for a big self storage brand. The website was split into two parts, a CMS using Sulu and an eCommerce web platform using Sylius. Both were based on the Symfony framework and used Vue.js for dynamic content."
      },
      {
         "position": "Full Stack Developer",
         "employer": "Candid",
         "startDate": "2022-08-01",
         "endDate": "2022-12-01",
         "description": "I worked remotely to improve and refactor internal systems that insurance agents use. Built using Laravel and Vue. I also worked on a prototype website using Strapi and node js."
      },
      {
         "position": "Software Developer",
         "employer": "Silicon Practice",
         "startDate": "2021-03-30",
         "endDate": "2022-08-01",
         "description": "In this remote role I worked to improve and maintain a product to allow customers to use doctor surgeries more effectively. This software was originally made using WordPress and a set of plugins but has been moving to Laravel with a Vue and JavaScript frontend. Most of my time was working on the Laravel side of the product building API, but I did spend time making and maintaining WordPress plugins. I used Docker on a Linux PC to develop the software and Git for version control. I used Node.js for dev tools like compiling frontend files."
      },
      {
         "position": "Web Developer",
         "employer": "Computer Assistance",
         "startDate": "2018-09-01",
         "endDate": "2021-03-31",
         "description": "My role was to make and maintain custom systems for a wide range of customers using a wide range of web technologies like PHP and JavaScript. I mostly worked with Laravel on the backend and a mix of Vue and Angular on the front end. Sometimes a customer would need a feature added to an existing system, and I had to adapt to the technologies that the customer's system was using."
      },
      {
         "position": "Full Stack Developer",
         "employer": "Brandon Cross Technologies",
         "startDate": "2015-12-01",
         "endDate": "2018-09-01",
         "description": "I am working as a full stack developer. I work with Node.js, PHP, MySQL, RESTful, and JavaScript. I have worked on award-winning iOS and Android apps using Apache Cordova. For this web app, we used Node with Express and Socket.io for the server, MySQL for the database, and a custom JavaScript framework for the browser client."
      }
   ],
   "education": [
      {
          "institution": "University of Portsmouth",
          "startDate": "2013-09-09",
          "endDate": "2015-07-22",
          "qualifications": [
              {
                  "name": "Certificate of Higher Education in Computing with Merit",
                  "modules": [
                     {
                        "name":"Year 1 modules",
                        "modules":[
                           "Computer architecture with math",
                           "Introduction to database design and development",
                           "Introduction to programming",
                           "Network fundamentals",
                           "Web foundations"
                        ]
                     },
                     {
                        "name":"Year 2 modules",
                        "modules":[
                           "Business information systems security",
                           "Web-script programming"
                        ]
                     }
                  ],
                  "grades": [
                      "merit"
                  ]
              }
          ],
          "description": "This degree course helped me develop my skills in lots of different areas of computing. For example, my programming has improved in areas like reliability, clarity, and efficiency. University has taught me how to self-study, time manage and work in a team. Due to the heavy requirement for written assessments, it was concluded that it would be better to focus on developing hands-on experience."
      },
      {
          "institution": "Amersham & Wycombe College, Amersham",
          "startDate": "2010-09-06",
          "endDate": "2013-06-28",
          "qualifications": [
              {
                  "name": "BTEC Extended Diploma ICT",
                  "grades": [
                      "distinction",
                      "merit",
                      "merit"
                  ]
              },
              {
                  "name": "BTEC First Diploma ICT",
                  "grades": [
                      "distinction"
                  ]
              }
          ]
      },
      {
          "institution": "Holmer Green School, High Wycombe",
          "startDate": "2006-09-01",
          "endDate": "2010-06-30",
          "qualifications": [
              {
                  "name": "Level 2 National Award in ICT",
                  "grades": [
                      "Pass"
                  ]
              },
              {
                  "name": "GCSE Business & Communication Systems",
                  "grades": [
                      "C"
                  ]
              },
              {
                  "name": "GCSE Science",
                  "grades": [
                      "C"
                  ]
              },
              {
                  "name": "GCSE Science Additional",
                  "grades": [
                      "C"
                  ]
              },
              {
                  "name": "GCSE Mathematics",
                  "grades": [
                      "D"
                  ]
              },
              {
                  "name": "Entry level English",
                  "grades": [
                      "Entry Level 3"
                  ]
              }
          ]
      }
  ],  
   "interests": "I am an enthusiastic and dedicated scout leader. For nearly 4 years I have been responsible for organizing and overseeing a vibrant weekly scout group for children between the ages of 11 and 15. Additionally, I am actively involved in the local theater group, where I specialize in managing the lighting and sound aspects of performances. I thoroughly enjoy spending quality time with my wife, engaging in our shared passion for tabletop gaming, which we regularly attend at a local board game shop.I have a keen interest in all things tech-related. I have personally implemented a smart home system, complete with DIY sensors, allowing me to automate various aspects of my living space while embracing the latest technological advancements."
}